/*
 * Copyright (C) 2017 Rdamicro Inc.
 *
 * This file is dual-licensed: you can use it either under the terms
 * of the GPL or the X11 license, at your option. Note that this dual
 * licensing only applies to this file, and not this project as a
 * whole.
 *
 ************************************************************
 * Auto generated code from asic documentation, DO NOT EDIT *
 ************************************************************
 */
#ifndef _RDA2720_GLB_H
#define _RDA2720_GLB_H

#define CTL_BASE_ANA_GLB 0x0C00
#define ANA_REG_GLB_BASE 0x0C00
#define REG32 volatile unsigned int

typedef struct {
	unsigned int chip_id_low;           /*0x0000*/
	unsigned int chip_id_high;          /*0x0004*/
	unsigned int module_en0;            /*0x0008*/
	unsigned int arm_clk_en0;           /*0x000c*/
	unsigned int rtc_clk_en0;           /*0x0010*/
	unsigned int soft_rst0;             /*0x0014*/
	unsigned int soft_rst1;             /*0x0018*/
	unsigned int power_pd_sw;           /*0x001c*/
	unsigned int power_pd_hw;           /*0x0020*/
	unsigned int soft_rst_hw;           /*0x0024*/
	unsigned int reserved_reg1;         /*0x0028*/
	unsigned int reserved_reg2;         /*0x002c*/
	unsigned int reserved_reg3;         /*0x0030*/
	unsigned int dcdc_clk_reg0;         /*0x0034*/
	unsigned int dcdc_core_reg0;        /*0x0038*/
	unsigned int dcdc_core_reg1;        /*0x003c*/
	unsigned int dcdc_core_reg2;        /*0x0040*/
	unsigned int dcdc_core_vol;         /*0x0044*/
	unsigned int dcdc_gen_reg0;         /*0x0048*/
	unsigned int dcdc_gen_reg1;         /*0x004c*/
	unsigned int dcdc_gen_reg2;         /*0x0050*/
	unsigned int dcdc_gen_vol;          /*0x0054*/
	unsigned int dcdc_wpa_reg0;         /*0x0058*/
	unsigned int dcdc_wpa_reg1;         /*0x005c*/
	unsigned int dcdc_wpa_reg2;         /*0x0060*/
	unsigned int dcdc_wpa_vol;          /*0x0064*/
	unsigned int dcdc_wpa_dcm_hw;       /*0x0068*/
	unsigned int dcdc_ch_ctrl;          /*0x006c*/
	unsigned int reserved_reg6;         /*0x0070*/
	unsigned int reserved_reg7;         /*0x0074*/
	unsigned int reserved_reg8;         /*0x0078*/
	unsigned int reserved_reg9;         /*0x007c*/
	unsigned int reserved_reg10;        /*0x0080*/
	unsigned int ldo_avdd18_reg0;       /*0x0084*/
	unsigned int ldo_avdd18_reg1;       /*0x0088*/
	unsigned int ldo_camio_reg0;        /*0x008c*/
	unsigned int ldo_camio_reg1;        /*0x0090*/
	unsigned int ldo_rf18a_reg0;        /*0x0094*/
	unsigned int ldo_rf18a_reg1;        /*0x0098*/
	unsigned int ldo_rf18b_reg0;        /*0x009c*/
	unsigned int ldo_rf18b_reg1;        /*0x00a0*/
	unsigned int ldo_camd_reg0;         /*0x00a4*/
	unsigned int ldo_camd_reg1;         /*0x00a8*/
	unsigned int ldo_con_reg0;          /*0x00ac*/
	unsigned int ldo_con_reg1;          /*0x00b0*/
	unsigned int ldo_mem_reg0;          /*0x00b4*/
	unsigned int ldo_mem_reg1;          /*0x00b8*/
	unsigned int ldo_sim0_reg0;         /*0x00bc*/
	unsigned int ldo_sim0_pd_reg;       /*0x00c0*/
	unsigned int ldo_sim0_reg1;         /*0x00c4*/
	unsigned int ldo_sim1_reg0;         /*0x00c8*/
	unsigned int ldo_sim1_pd_reg;       /*0x00cc*/
	unsigned int ldo_sim1_reg1;         /*0x00d0*/
	unsigned int ldo_sim2_reg0;         /*0x00d4*/
	unsigned int ldo_sim2_pd_reg;       /*0x00d8*/
	unsigned int ldo_sim2_reg1;         /*0x00dc*/
	unsigned int ldo_cama_reg0;         /*0x00e0*/
	unsigned int ldo_cama_reg1;         /*0x00e4*/
	unsigned int ldo_cammot_reg0;       /*0x00e8*/
	unsigned int ldo_cammot_reg1;       /*0x00ec*/
	unsigned int ldo_emmccore_reg0;     /*0x00f0*/
	unsigned int ldo_emmccore_pd_reg;   /*0x00f4*/
	unsigned int ldo_emmccore_reg1;     /*0x00f8*/
	unsigned int ldo_sd_reg0;           /*0x00fc*/
	unsigned int ldo_sd_pd_reg;         /*0x0100*/
	unsigned int ldo_sd_reg1;           /*0x0104*/
	unsigned int ldo_sdio_reg0;         /*0x0108*/
	unsigned int ldo_sdio_pd_reg;       /*0x010c*/
	unsigned int ldo_sdio_reg1;         /*0x0110*/
	unsigned int ldo_vdd28_reg0;        /*0x0114*/
	unsigned int ldo_vdd28_reg1;        /*0x0118*/
	unsigned int ldo_wifipa_reg0;       /*0x011c*/
	unsigned int ldo_wifipa_reg1;       /*0x0120*/
	unsigned int ldo_dcxo_reg0;         /*0x0124*/
	unsigned int ldo_dcxo_reg1;         /*0x0128*/
	unsigned int ldo_usb_reg0;          /*0x012c*/
	unsigned int ldo_usb_pd_reg;        /*0x0130*/
	unsigned int ldo_usb_reg1;          /*0x0134*/
	unsigned int reserved_reg17;        /*0x0138*/
	unsigned int reserved_reg18;        /*0x013c*/
	unsigned int reserved_reg19;        /*0x0140*/
	unsigned int reserved_reg20;        /*0x0144*/
	unsigned int ldo_trim_reg;          /*0x0148*/
	unsigned int ldo_rtc_ctrl;          /*0x014c*/
	unsigned int ldo_ch_ctrl;           /*0x0150*/
	unsigned int reserved_reg23;        /*0x0154*/
	unsigned int reserved_reg24;        /*0x0158*/
	unsigned int reserved_reg25;        /*0x015c*/
	unsigned int reserved_reg26;        /*0x0160*/
	unsigned int reserved_reg27;        /*0x0164*/
	unsigned int slp_ctrl;              /*0x0168*/
	unsigned int slp_dcdc_pd_ctrl;      /*0x016c*/
	unsigned int slp_ldo_pd_ctrl0;      /*0x0170*/
	unsigned int slp_ldo_pd_ctrl1;      /*0x0174*/
	unsigned int slp_dcdc_lp_ctrl;      /*0x0178*/
	unsigned int slp_ldo_lp_ctrl0;      /*0x017c*/
	unsigned int slp_ldo_lp_ctrl1;      /*0x0180*/
	unsigned int dcdc_core_slp_ctrl0;   /*0x0184*/
	unsigned int dcdc_core_slp_ctrl1;   /*0x0188*/
	unsigned int dcdc_xtl_en0;          /*0x018c*/
	unsigned int reseved_dcdc_xtl_en4;  /*0x0190*/
	unsigned int ldo_xtl_en0;           /*0x0194*/
	unsigned int ldo_xtl_en1;           /*0x0198*/
	unsigned int ldo_xtl_en2;           /*0x019c*/
	unsigned int ldo_xtl_en3;           /*0x01a0*/
	unsigned int ldo_xtl_en4;           /*0x01a4*/
	unsigned int ldo_xtl_en5;           /*0x01a8*/
	unsigned int ldo_xtl_en6;           /*0x01ac*/
	unsigned int ldo_xtl_en7;           /*0x01b0*/
	unsigned int ldo_xtl_en8;           /*0x01b4*/
	unsigned int ldo_xtl_en9;           /*0x01b8*/
	unsigned int ldo_xtl_en10;          /*0x01bc*/
	unsigned int reserved_reg30;        /*0x01c0*/
	unsigned int reserved_reg31;        /*0x01c4*/
	unsigned int reserved_reg32;        /*0x01c8*/
	unsigned int reserved_reg_core;     /*0x01cc*/
	unsigned int reserved_reg_rtc;      /*0x01d0*/
	unsigned int bg_ctrl;               /*0x01d4*/
	unsigned int dcdc_vlg_sel;          /*0x01d8*/
	unsigned int ldo_vlg_sel0;          /*0x01dc*/
	unsigned int clk32kless_ctrl0;      /*0x01e0*/
	unsigned int clk32kless_ctrl1;      /*0x01e4*/
	unsigned int xtl_wait_ctrl0;        /*0x01e8*/
	unsigned int rgb_ctrl;              /*0x01ec*/
	unsigned int ib_ctrl;               /*0x01f0*/
	unsigned int flash_ctrl;            /*0x01f4*/
	unsigned int kpled_ctrl0;           /*0x01f8*/
	unsigned int kpled_ctrl1;           /*0x01fc*/
	unsigned int vibr_ctrl0;            /*0x0200*/
	unsigned int vibr_ctrl1;            /*0x0204*/
	unsigned int audio_ctrl0;           /*0x0208*/
	unsigned int chgr_ctrl0;            /*0x020c*/
	unsigned int chgr_ctrl1;            /*0x0210*/
	unsigned int chgr_status;           /*0x0214*/
	unsigned int chgr_det_fgu_ctrl;     /*0x0218*/
	unsigned int ovlo_ctrl;             /*0x021c*/
	unsigned int mixed_ctrl;            /*0x0220*/
	unsigned int por_rst_monitor;       /*0x0224*/
	unsigned int wdg_rst_monitor;       /*0x0228*/
	unsigned int por_pin_rst_monitor;   /*0x022c*/
	unsigned int por_src_flag;          /*0x0230*/
	unsigned int por_off_flag;          /*0x0234*/
	unsigned int por_7s_ctrl;           /*0x0238*/
	unsigned int hwrst_rtc;             /*0x023c*/
	unsigned int arch_en;               /*0x0240*/
	unsigned int mcu_wr_prot_value;     /*0x0244*/
	unsigned int pwr_wr_prot_value;     /*0x0248*/
	unsigned int smpl_ctrl0;            /*0x024c*/
	unsigned int smpl_ctrl1;            /*0x0250*/
	unsigned int rtc_rst0;              /*0x0254*/
	unsigned int rtc_rst1;              /*0x0258*/
	unsigned int rtc_rst2;              /*0x025c*/
	unsigned int rtc_clk_stop;          /*0x0260*/
	unsigned int vbat_drop_cnt;         /*0x0264*/
	unsigned int swrst_ctrl0;           /*0x0268*/
	unsigned int swrst_ctrl1;           /*0x026c*/
	unsigned int otp_ctrl;              /*0x0270*/
	unsigned int free_timer_low;        /*0x0274*/
	unsigned int free_timer_high;       /*0x0278*/
	unsigned int vol_tune_ctrl_core;    /*0x027c*/
} HWP_ANA_REG_GLB_T;

#define hwp_ana_reg_glb		((HWP_ANA_REG_GLB_T *) ANA_REG_GLB_BASE)
#if 0
#define ANA_REG_GLB_ARM_MODULE_EN	        ANA_REG_GLB_MODULE_EN0
#define ANA_REG_GLB_ARM_CLK_EN		        ANA_REG_GLB_ARM_CLK_EN0
#define ANA_REG_GLB_RTC_CLK_EN		        ANA_REG_GLB_RTC_CLK_EN0
#define ANA_REG_GLB_XTL_WAIT_CTRL		ANA_REG_GLB_XTL_WAIT_CTRL0
#endif

/*-----------------------------------------------------------
 * Register Name          :   ANA_REG_GLB_CHIP_ID_LOW
 * Register Offset        :   0x0000
 * Register Description   :
-----------------------------------------------------------*/

#define BITS_CHIP_ID_LOW(x)                     (((x) & 0xFFFF) << 0)


/*-----------------------------------------------------------
* Register Name          :   ANA_REG_GLB_CHIP_ID_HIGH
* Register Offset        :   0x0004
* Register Description   :
-----------------------------------------------------------*/

