
/**--------------------------------------------------------------------------*
 **                         Include Files                                    *
 **--------------------------------------------------------------------------*/
#include "sci_types.h"
#include "os_api.h"
#include "mmk_type.h"
#include "mmi_module.h"

/**--------------------------------------------------------------------------*
 **                         Compiler Flag                                    *
 **--------------------------------------------------------------------------*/
#ifdef __cplusplus
    extern   "C"
    {
#endif

/**--------------------------------------------------------------------------*
 **                         MACRO DEFINITION                                 *
 **--------------------------------------------------------------------------*/


/**--------------------------------------------------------------------------*
 **                         TYPE AND CONSTANT                                *
 **--------------------------------------------------------------------------*/

#define WIN_ID_DEF(win_id)          win_id

// 窗口ID
typedef enum
{
    ZTEWEATHER_WIN_ID_START = (MMI_MODULE_ZTEWEATHER << 16),

	ZTEWEATHER_MAIN_WIN_ID,//主界面

	ZTEWEATHER_FORECAST_WIN_ID,//预报界面
	
    ZTEWEATHER_MAX_WIN_ID
}ZTEWEATHER_WINDOW_ID_E;

#undef WIN_ID_DEF

// 控件ID
typedef enum
{
    ZTEWEATHER_CTRL_ID_ID_START = ZTEWEATHER_MAX_WIN_ID,


    ZTEWEATHER_MAX_CTRL_ID
}ZTEWEATHER_CONTROL_ID_E;

/**--------------------------------------------------------------------------*
 **                         FUNCTION DEFINITION                              *
 **--------------------------------------------------------------------------*/


/**--------------------------------------------------------------------------*
 **                         Compiler Flag                                    *
 **--------------------------------------------------------------------------*/
#ifdef   __cplusplus
    }
#endif

