/******************************************************************************
**
**
**
**  通话计费模块
**
**
**
**
**
**
*******************************************************************************/

#ifndef  _MMICL_COSTS_WINTAB_H_    
#define  _MMICL_COSTS_WINTAB_H_ 

#ifdef AOC_SUPPORT
/**--------------------------------------------------------------------------*
 **                         Include Files                                    *
 **--------------------------------------------------------------------------*/
/**--------------------------------------------------------------------------*
 **                         Compiler Flag                                    *
 **--------------------------------------------------------------------------*/
#ifdef __cplusplus
    extern "C"
    {
#endif




//---------------------------------------------------------------------------
//
//  PUCT 存储结构体
//
//  
//
//
//
//---------------------------------------------------------------------------

typedef struct
{
    BOOLEAN			   is_ok;                    // 是否可以使用
    BOOLEAN 		   is_service_support;       // 服务器是否支持
    uint8	           currency_code[4];		 // 话费计费单位
	BOOLEAN            ex_sign;	                 // 指数符号
	uint8	           ex;                       // 计费指数
	uint32	           eppu;					 // 每单元计费数为 eppu*10^ex
}SIM_PUCT_INFO_T;



void  HandlePuctInfoCnf(DPARAM  param);

void  MMICL_COSTS_HandleMainMenuMsg(MMI_MENU_ID_T menu_id);


/**--------------------------------------------------------------------------*
 **                         Compiler Flag                                    *
 **--------------------------------------------------------------------------*/
#ifdef __cplusplus
    }
#endif

#endif//AOC_SUPPORT
#endif
