/*****************************************************************************
 ** File Name:     msdev_param.h                                             *
 ** Author:        yifeng.wang                                               *
 ** Date:          2008/02/27                                                *
 ** Copyright:     2008 Spreadtrum, Incorporated. All Rights Reserved.       *
 ** Description:   interfaces for windows network interface.                 *
 *****************************************************************************
 **                        Edit History                                      *
 ** -------------------------------------------------------------------------*
 ** DATE           NAME                   DESCRIPTION                        *
 ** 2008/02/27     yifeng.wang            Create                             *
 ** 2008/03/16     yifeng.wang            Add network connection states API  *
 ** 2010/08/31     yifeng.wang            Add more convenient interfaces.    *
 *****************************************************************************/

#ifndef _MSNET_PARAM_H_
#define _MSNET_PARAM_H_

#include "IPTypes.h"

/*---------------------------------------------------------------------------*
 *                         TYPE DEFINITION                                   *
 *---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*
 *                         FUNCTION DECLARE                                  *
 *---------------------------------------------------------------------------*/
/*****************************************************************************/
// Description : 获得本地电脑的网络参数 
// Global : 
// Author : yifeng.wang
// Note : 
/*****************************************************************************/
PFIXED_INFO MSNET_GetNetworkParams( void );

/*****************************************************************************/
// Description : 获得本地电脑的网络设备信息 
// Global : 
// Author : yifeng.wang
// Note : 
/*****************************************************************************/
PIP_ADAPTER_INFO MSNET_GetAdaptersInfo( void );

/*****************************************************************************/
// Description : 获得本地电脑的默认网络设备 
// Global : 
// Author : yifeng.wang
// Note : 智能选择可用网络设备
/*****************************************************************************/
PIP_ADAPTER_INFO MSNET_GetDefaultAdapter( void );

/*****************************************************************************/
// Description : 获得匹配网络设备名的网络设备信息
// Global : s_pAdaptInfo
// Author : yifeng.wang
// Note : 
/*****************************************************************************/
PIP_ADAPTER_INFO MSNET_GetAdapterByName( CString strName );

/*****************************************************************************/
// Description : 清除网络参数记录 
// Global : 
// Author : yifeng.wang
// Note : 
/*****************************************************************************/
void MSNET_ReleaseNetworkParams( void );

/*****************************************************************************/
// Description : 清除网络设备信息记录 
// Global : 
// Author : yifeng.wang
// Note : 
/*****************************************************************************/
void MSNET_ReleaseAdaptersInfo( void );

/*****************************************************************************/
// Description : 查询本地电脑的连接状态
// Global : none
// Author : yifeng.wang
// Note : 该函数只能检测系统网络设置是否连通，而不能检测物理连接，
//        而且该功能的正常工作需要系统开启 System Event Notification 服务；
//        若函数返回FALSE，网络一定不通；返回TRUE，网络不一定通
/*****************************************************************************/
BOOL MSNET_IsNetworkConnected( void );


#endif /* _MSNET_PARAM_H_ */