/******************************************************************************
**
**
**
**  小区广播模块
**
**
**
**
**
**
*******************************************************************************/
#if defined(MMI_SMSCB_SUPPORT)

#ifndef  _MMISMSCB_INTERNAL_H_    
#define  _MMISMSCB_INTERNAL_H_   
/**--------------------------------------------------------------------------*
 **                         Include Files                                    *
 **--------------------------------------------------------------------------*/
#include "mmk_type.h"
#include "mn_type.h"

/**--------------------------------------------------------------------------*
 **                         Compiler Flag                                    *
 **--------------------------------------------------------------------------*/
#ifdef __cplusplus
    extern "C"
    {
#endif


#define MMI_MAX_CB_LANGUAGE_NUM (MN_CB_LANGUAGE_ID_MAX_NUM + 1)               //最大语言数
#ifdef MMI_ETWS_SUPPORT
#define MMI_CB_CHANNEL_NAME_LEN 30               //最大信道列表数
#else
#define MMI_CB_CHANNEL_NAME_LEN 10               //最大信道列表数
#endif
#define MMI_MAX_CB_CHANNEL_NUM  MN_CB_MSG_ID_MAX_NUM               //最大信道数

#ifdef MMI_ETWS_SUPPORT
#define MMI_MAX_CB_MSG_NUM      10     //最大广播信息存储数
#else
#define MMI_MAX_CB_MSG_NUM      (10 * MMI_DUAL_SYS_MAX)     //最大广播信息存储数
#endif
//------------------------------------------------------------------------------------------
//
// 小区广播语言选择列表结构
//
//------------------------------------------------------------------------------------------
typedef struct{

    BOOLEAN selected_arr[MMI_MAX_CB_LANGUAGE_NUM];                       //语言选择列表数组

}MMISMS_CB_LANGUAGE_T;


//------------------------------------------------------------------------------------------
//
// 小区广播信道名称结构
//
//------------------------------------------------------------------------------------------
typedef struct{

        wchar    wstr[MMI_CB_CHANNEL_NAME_LEN + 1];                           //信道名称字符串数组
        uint16   wstr_len;                                                //信道名称长度
}MMISMS_CB_CHANNEL_NAME_T;

//------------------------------------------------------------------------------------------
//
// 小区广播信道选项结构
//
//------------------------------------------------------------------------------------------
typedef struct{

        MN_CB_MSG_ID_T           msg_id;                                 //信道索引号
        MMISMS_CB_CHANNEL_NAME_T name;                                   //信道名称数组
        BOOLEAN is_enabled;                                              //是否开启       

}MMISMS_CB_CHANNEL_ITEM_T;

//------------------------------------------------------------------------------------------
//
// 小区广播信道列表结构
//
//------------------------------------------------------------------------------------------
typedef struct{

        uint16 num;                                                      //信道总数
        MMISMS_CB_CHANNEL_ITEM_T channel_arr[MMI_MAX_CB_CHANNEL_NUM];    //信道选项数组

}MMISMS_CB_CHANNEL_T;


/******************************************************************************************************************/
//
//
//                        小区广播模块对外接口函数声明
//
//
/******************************************************************************************************************/

//----------------------------------------------------------------------------------------------------------------
//
//  函数名：         MMISMSCB_Init
//  功能描述:        初始化小区广播接口函数(在手机初始化时调用, MMIMAIN.c 中调用)
//  全局变量使用:    无
//  返回值:          MN_RETURN_SUCCESS 初始化成功，MN_RETURN_FAILURE 初始化失败
//  作者:            肖凡
//
//----------------------------------------------------------------------------------------------------------------
MN_RETURN_RESULT_E MMISMSCB_Init(MN_DUAL_SYS_E dual_sys);

/*****************************************************************************/
//     Description : open SMSCB main menu window      
//    Global resource dependence : 
//  Author: Tracy Zhang
//    Note: 
/*****************************************************************************/
void MMISMSCB_OpenMainMenu(void);

//----------------------------------------------------------------------------------------------------------------
//
//  函数名：         MMISMSCB_SwitchSmsCBStatus
//  功能描述:        切换小区广播启动状态
//  全局变量使用:    无
//  返回值:          无
//  作者:            肖凡
//
//----------------------------------------------------------------------------------------------------------------
void MMISMSCB_SwitchSmsCBStatus(
                                BOOLEAN cb_enabled      //要切换的状态 (输入参数)
                                );

/*****************************************************************************/
//  Description : open SMSCB setting window      
//  Global resource dependence : 
//  Author: fengming.huang
//  Note: 
/*****************************************************************************/
void MMISMSCB_OpenSettingWin(void);

/**--------------------------------------------------------------------------*
 **                         Compiler Flag                                    *
 **--------------------------------------------------------------------------*/
#ifdef __cplusplus
    }
#endif

#endif
#endif //#if defined(MMI_SMSCB_SUPPORT)

