/*************************************************************************
 ** File Name:      mmivt_nv.h                                              *
 ** Author:         bin.ji                                          *
 ** Date:           2006/05/17                                           *
 ** Copyright:      2006 Spreadtrum, Incoporated. All Rights Reserved.    *
 ** Description:     This file defines the function about nv             *
 *************************************************************************
 *************************************************************************
 **                        Edit History                                  *
 ** ---------------------------------------------------------------------*
 ** DATE           NAME             DESCRIPTION                          *
 ** 2007/3/13     bin.ji      Create.                              *
*************************************************************************/

#ifndef VT_NV_H_
#define VT_NV_H_

#ifdef VT_SUPPORT

#include "sci_types.h"
#include "mmi_module.h"

/**--------------------------------------------------------------------------*
 **                         Compiler Flag                                    *
 **--------------------------------------------------------------------------*/
#ifdef __cplusplus
    extern   "C"
    {
#endif

/**--------------------------------------------------------------------------*
 **                         TYPE AND CONSTANT                                *
 **--------------------------------------------------------------------------*/
typedef enum
{
    MMINV_VT_RECORD_ID = MMI_MODULE_VT << 16,//add by xiongxiaoyan 20060427
    MMINV_VT_IS_EP_DEFAULT, //工程模式里面设置VT默认声音设备是否为耳机（主要为3g at自动测试）
}VT_NV_ITEM_E;


/**--------------------------------------------------------------------------*
 **                         MACRO DEFINITION                                 *
 **--------------------------------------------------------------------------*/


/*****************************************************************************/
// 	Description : register vt module nv len and max item
//	Global resource dependence : none
//  Author: bin.ji
//	Note:
/*****************************************************************************/
PUBLIC void MMIVT_RegNv(void);

/**--------------------------------------------------------------------------*
 **                         Compiler Flag                                    *
 **--------------------------------------------------------------------------*/
#ifdef   __cplusplus
    }
#endif

#endif	//#ifdef VT_SUPPORT

#endif

