/*==============================================================================
File Name: mmiim_tp_multitap_9key.h
Author: Haiwu.Chen
Date: 2010/09/27
Copyright: 2010 Spreadtrum, Incorporated. All Rights Reserved.
Description:
--------------------------------------------------------------------------------
Edit History
--------------------------------------------------------------------------------
DATE         NAME            DESCRIPTION
2010/09/27   Haiwu.Chen      Create.
==============================================================================*/
#ifndef _MMIIM_TP_MULTITAP_9KEY_H_
#define _MMIIM_TP_MULTITAP_9KEY_H_

#if defined(TOUCH_PANEL_SUPPORT)

/*----------------------------------------------------------------------------*/
/*                          Include Files                                     */
/*----------------------------------------------------------------------------*/
#include "mmiim_sp_tp_basic.h"
#include "mmiim_sp_ml_data.h"


/**--------------------------------------------------------------------------*
**                         MACRO DEFINITION                                 *
**--------------------------------------------------------------------------*/
#define MMIIM_MULTITAP_9KEY_CANDIDATE_TIMER_OUT   800


/*----------------------------------------------------------------------------*/
/*                         Compiler Flag                                      */
/*----------------------------------------------------------------------------*/

#ifdef _cplusplus
extern   "C"
{
#endif

/*----------------------------------------------------------------------------*/
/*                         MACRO DEFINITION                                   */
/*----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------*/
/*                          TYPE AND STRUCT                                   */
/*----------------------------------------------------------------------------*/
typedef struct
{
    BOOLEAN                 is_timer_active;        // is time active
    uint8                   key_timer_id;

    MMIIM_SP_ML_DATA_T      language_data;          // language data

    BOOLEAN                 has_choice_content;              //内部状态

    int16                   last_multitap_press_index;       // 上一次的有效按键，此值是ml_9key_table中的索引值
    int16                   last_multitap_char_index;        // 对应一行后，并在字母中查找顺序
    
} MMIIM_TP_MULTITAP_9KEY_DATA_T;


/*----------------------------------------------------------------------------*/
/*                         Function Declare                                   */
/*----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------*/
/*                         Compiler Flag                                      */
/*----------------------------------------------------------------------------*/
#ifdef _cplusplus
}
#endif

#endif //#if defined(TOUCH_PANEL_SUPPORT)

#endif //_MMIIM_TP_MULTITAP_9KEY_H_

