/****************************************************************************
** File Name:      mmicc_speeddial.h                                                 *
** Author:          jibin                                                       *
** Date:           08/23/2004                                              *
** Copyright:      2004 Spreadtrum, Incoporated. All Rights Reserved.       *
** Description:    This file is used to describe the speeddial               *
****************************************************************************
**                         Important Edit History                          *
** ------------------------------------------------------------------------*
** DATE           NAME             DESCRIPTION                             *
** 08/23/2004     jibin             Create
** 
****************************************************************************/
#if defined(MMI_SPEEDDIAL_SUPPORT)
#ifndef _MMICC_SPEEDDIAL_H_    
#define _MMICC_SPEEDDIAL_H_   

/**----------------------------------------------------------------------*
 **                         Include Files                                *
 **----------------------------------------------------------------------*/

#include "mmk_app.h"
#include "guilistbox.h"
#include "mmipb_export.h"
/**---------------------------------------------------------------------------*
 **                         Compiler Flag                                     *
 **---------------------------------------------------------------------------*/
 
#ifdef __cplusplus
    extern   "C"
    {
#endif

/**---------------------------------------------------------------------------*
 **                         MACRO DEFINITION                                  *
 **---------------------------------------------------------------------------*/
#define SPEEDKEY_MAX_NUM 8

// @baokun end 
#define SPEEDKEY_PROMPT_LEN         (6 + MMIPB_MAX_STRING_LEN) //cr93923,如果快速拨号查看时，号码或数字个数等于或超过20，加上前面的6，就会超出范围
#define SPEEDKEY_MAX_LEN            (PHONEBOOK_MAX_DN_NUMBER_LEN * 2 + 2)
#define SPEEDKEY_VIEW_NAME_RIGHT    80

/**--------------------------------------------------------------------------*
 **                         TYPE AND STRUCT                                *
 **--------------------------------------------------------------------------*/

/**---------------------------------------------------------------------------*
 **                         FUNCTION DEFINITION                               *
 **---------------------------------------------------------------------------*/


/**---------------------------------------------------------------------------*
 **                         Compiler Flag                                     *
 **---------------------------------------------------------------------------*/
 
#ifdef   __cplusplus
    }
#endif

#endif
#endif//MMI_SPEEDDIAL_SUPPORT

