/*! @file guiim_base.h
@brief 输入法模块的类型定义，包括了基础类型定义和面向应用的类型定义
@author Lianxiang.Zhou
@version 1.0
@date 2009/08/08
@remarks Copyright: 2011 Spreadtrum, Incorporated. All Rights Reserved.
@note 2009/08/08   Lianxiang.Zhou  Create.
@note 应该将基础定义部分和面向应用的部分分开。
@sa @ref page_ImBase
@sa imBaseGrp
@details 这个文件的内容有两部分，基础定义和面向应用的定义。
- 基础定义，即同时应用于输入法控件两个方向的类型
- 面向应用的定义，即输入法应用相关的定义
*******************************************************************************/

/*! @page page_ImBase 输入法基础类型及app相关定义(ImBase)

@sa @ref page_Im
*******************************************************************************/

/*! @addtogroup imBaseGrp ImBase
@brief 这个模块是输入法的基本数据定义
@sa @ref page_ImBase
@details 这个模块，不仅仅是针对输入法控件的用户，也是输入法应用需要使用的。
@{
*******************************************************************************/

#ifndef _GUIIM_BASE_H_
#define _GUIIM_BASE_H_

/*------------------------------------------------------------------------------
    Include Files
------------------------------------------------------------------------------*/
#include "ctrlim_base.h"

/*------------------------------------------------------------------------------
    Macro Declaration
------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
    TYPE AND STRUCT
------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
    Compiler Flag
------------------------------------------------------------------------------*/
#ifdef __cplusplus 
extern "C"{ 
#endif 

/*------------------------------------------------------------------------------
    FUNCTION DEFINITION
------------------------------------------------------------------------------*/
#define GUIIM_SetNotify   CTRLIM_SetNotify
#define GUIIM_CommitData  CTRLIM_CommitData
#define GUIIM_AppendWin   CTRLIM_AppendWin
#define GUIIM_RemoveWin   CTRLIM_RemoveWin
/*------------------------------------------------------------------------------
    Compiler Flag
------------------------------------------------------------------------------*/
#ifdef __cplusplus 
} 
#endif 

#endif //_GUIIM_BASE_H_

/*@}*/
